# DuctTerminalEngagementLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DuctTerminalEngagementLength Property
ParameterTypeId Class See Also
---
"Engagement Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DuctTerminalEngagementLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuctTerminalEngagementLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DuctTerminalEngagementLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace